app/views/photos/_form.html.erb

SELECT "categories".* FROM "categories"
---
	<p><%= f.label :category %><br>
	<%= select_tag "category_id", options_from_collection_for_select(Category.all, :id, :name), class: "btn btn-default dropdown-toggle" %></p>