app/views/photos/index.html.erb

<div class="col-md-5 photo">
	<%= image_tag photo.photo_url, width: 400, height: 300 unless photo.blank?%>
---
SELECT "photos".* FROM "photos"


<!-- 	<p><%= link_to "Like", like_photo_path(photo), method: :put %> (<%= photo.get_upvotes.size %>) or
---
SELECT  "votes".* FROM "votes" WHERE "votes"."photo_id" = ? LIMIT ?  [["photo_id", 5], ["LIMIT", 1]]