app/controllers/pages_controller.rb

SELECT  "posts".* FROM "posts" ORDER BY created_at DESC LIMIT ? OFFSET ?  [["LIMIT", 4], ["OFFSET", 0]]
SELECT COUNT(*) FROM "posts"
---
  def index
  	 @posts = Post.all.paginate(:page => params[:page], :per_page => 4)