app/controllers/photos_controller.rb

SELECT  "photos".* FROM "photos" WHERE "photos"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
	def upvote
		@photo = Photo.find(params[:id])

SELECT  "photos".* FROM "photos" WHERE "photos"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
	def downvote
		@photo = Photo.find(params[:id])