app/controllers/photos_controller.rb

	def index
		@photos = Photo.all
		@like = {}
		@photos.each do |photo|
			@vote = Vote.find_by_photo_id(photo.id)
---
SELECT "photos".* FROM "photos"
SELECT  "votes".* FROM "votes" WHERE "votes"."photo_id" = ? LIMIT ?  [["photo_id", 5], ["LIMIT", 1]]

	def create
		params[:photo][:category_id] = params[:category_id]
		params[:photo][:user_id] = current_user.id
		@photo = Photo.create(photo_params)
---
INSERT INTO "photos" ("user_id", "name", "category_id", "created_at", "updated_at", "photo") VALUES (?, ?, ?, ?, ?, ?)  [["user_id", 2], ["name", "Photo1"], ["category_id", 1], ["created_at", "2017-11-27 10:41:46.771338"], ["updated_at", "2017-11-27 10:41:46.771338"], ["photo", "images.jpg"]]

	def edit
		@photo = Photo.find(params[:id])
---
SELECT  "photos".* FROM "photos" WHERE "photos"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

	def update
		Photo.find(params[:id]).update
---
SELECT  "photos".* FROM "photos" WHERE "photos"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "photos" SET "photo" = ?, "updated_at" = ? WHERE "photos"."id" = ?  [["photo", "f4.jpg"], ["updated_at", "2017-12-04 18:47:12.868157"], ["id", 5]]

	def destroy
		Photo.find(params[:id]).destroy
---
DELETE FROM "photos" WHERE "photos"."id" = ?  [["id", 1]]
SELECT  "photos".* FROM "photos" WHERE "photos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

	def vote
		pp @photo = Photo.find(params[:id])
		pp @vote = Vote.find_by_photo_id(@photo.id)

		if @vote == nil
			@like = 1
			Vote.create(user_id: current_user.id, photo_id: @photo.id, like: @like)
		else
			@vote.update(like: @vote.like+1)
---
SELECT  "photos".* FROM "photos" WHERE "photos"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
SELECT  "votes".* FROM "votes" WHERE "votes"."photo_id" = ? LIMIT ?  [["photo_id", 5], ["LIMIT", 1]]
INSERT INTO "votes" ("user_id", "photo_id", "like", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 2], ["photo_id", 5], ["like", 1], ["created_at", "2017-12-01 10:51:50.863687"], ["updated_at", "2017-12-01 10:51:50.863687"]]
UPDATE "votes" SET "photo_id" = ?, "like" = ?, "updated_at" = ? WHERE "votes"."id" = ?  [["photo_id", 6], ["like", 2], ["updated_at", "2017-12-01 11:02:58.075150"], ["id", 1]]