app/controllers/posts_controller.rb

  def create
  	@post = current_user.posts.build(post_params)
  	if @post.save
---
INSERT INTO "posts" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "First Post"], ["body", "First"], ["user_id", 1], ["created_at", "2017-10-30 11:18:37.893343"], ["updated_at", "2017-10-30 11:18:37.893343"]]

  def update

  	@post.update(post_params)
---
UPDATE "posts" SET "title" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "Second Post d"], ["updated_at", "2017-11-03 17:49:43.306644"], ["id", 2]]