app/controllers/postcomments_controller.rb

INSERT INTO "postcomments" ("comment", "post_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["comment", "dd"], ["post_id", 4], ["user_id", 4], ["created_at", "2017-11-06 11:31:11.443039"], ["updated_at", "2017-11-06 11:31:11.443039"]]
---
  def create
    params[:postcomment][:post_id]=params[:post_id]
    params[:postcomment][:user_id]=current_user.id
    @comment = Postcomment.create(comment_params)

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 22], ["LIMIT", 1]]
SELECT  "postcomments".* FROM "postcomments" WHERE "postcomments"."post_id" = ? AND "postcomments"."id" = ? LIMIT ?  [["post_id", 22], ["id", 1], ["LIMIT", 1]]
---
  def edit
    @post = Post.find(params[:post_id])
    @comment = @post.postcomments.find(params[:id])

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 22], ["LIMIT", 1]]
SELECT  "postcomments".* FROM "postcomments" WHERE "postcomments"."post_id" = ? AND "postcomments"."id" = ? LIMIT ?  [["post_id", 22], ["id", 1], ["LIMIT", 1]]
UPDATE "postcomments" SET "comment" = ?, "updated_at" = ? WHERE "postcomments"."id" = ?  [["comment", "eeeeeeeeee"], ["updated_at", "2017-12-04 13:09:30.250908"], ["id", 1]]
---
  def update
    @post = Post.find(params[:post_id])
    @comment = @post.postcomments.find(params[:id])
    if @comment.update(comment_params)

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 22], ["LIMIT", 1]]
SELECT  "postcomments".* FROM "postcomments" WHERE "postcomments"."post_id" = ? AND "postcomments"."id" = ? LIMIT ?  [["post_id", 22], ["id", 1], ["LIMIT", 1]]
DELETE FROM "postcomments" WHERE "postcomments"."id" = ?  [["id", 1]]
---
  def destroy
    @post = Post.find(params[:post_id])
    @comment = @post.postcomments.find(params[:id])
    @comment.destroy